In [1]:
import sqlite3
database = "basketball.sqlite"
conn = sqlite3.connect(database)
print("Database connected successfully....")

Database connected successfully....

In [3]:
conn.execute(
  """CREATE TABLE MAHDI_HASAN
  (
    SNO INT UNIQUE,
    ROLL INT NOT NULL,
    NAME TEXT,
    MARKS REAL
  )
  """
)
print("Table Created successfully")

Table Created successfully

In [7]:
conn.execute("INSERT INTO MAHDI_HASAN (SNO, ROLL, NAME, MARKS) VALUES (1, 101, 'Mahdi', 95.5)")
conn.execute("INSERT INTO MAHDI_HASAN (SNO, ROLL, NAME, MARKS) VALUES (2, 102, 'Hasan', 89.0)")
conn.execute("INSERT INTO MAHDI_HASAN (SNO, ROLL, NAME, MARKS) VALUES (3, 103, 'Ayaan', 76.5)")
conn.execute("INSERT INTO MAHDI_HASAN (SNO, ROLL, NAME, MARKS) VALUES (4, 104, 'Fatima', NULL)")

conn.commit()
print("Values added")

IntegrityError: UNIQUE constraint failed: MAHDI_HASAN.SNO

In [8]:
conn.execute("DELETE FROM MAHDI_HASAN")
conn.commit()
print("Old data deleted")

Old data deleted

In [9]:
conn.execute("INSERT INTO MAHDI_HASAN (SNO, ROLL, NAME, MARKS) VALUES (1, 101, 'Mahdi', 95.5)")
conn.execute("INSERT INTO MAHDI_HASAN (SNO, ROLL, NAME, MARKS) VALUES (2, 102, 'Hasan', 89.0)")
conn.execute("INSERT INTO MAHDI_HASAN (SNO, ROLL, NAME, MARKS) VALUES (3, 103, 'Ayaan', 76.5)")
conn.execute("INSERT INTO MAHDI_HASAN (SNO, ROLL, NAME, MARKS) VALUES (4, 104, 'Fatima', NULL)")
conn.commit()
print("Values added again successfully")

Values added again successfully

In [10]:
import pandas as pd

table = pd.read_sql("""SELECT * FROM sqlite_master WHERE type='table';""", conn)

table

,type,name,tbl_name,rootpage,sql
0,table,Team_Attributes,Team_Attributes,2,"CREATE TABLE `Team_Attributes` (`ID`, `ABBREVI..."
1,table,Player_Salary,Player_Salary,5,"CREATE TABLE `Player_Salary` (`slugSeason`, `n..."
2,table,Draft,Draft,36,"CREATE TABLE `Draft` (`yearDraft`, `numberPick..."
3,table,Team,Team,314,"CREATE TABLE `Team` (`id`, `full_name`, `abbre..."
4,table,Player_Attributes,Player_Attributes,315,"CREATE TABLE `Player_Attributes` (`ID`, `FIRST..."
5,table,Player,Player,617,"CREATE TABLE `Player` (`id`, `full_name`, `fir..."
6,table,MAHDI_HASAN,MAHDI_HASAN,664,CREATE TABLE MAHDI_HASAN\n (\n SNO INT UNI...

In [11]:
MH = pd.read_sql("""SELECT * FROM MAHDI_HASAN;""", conn)

In [12]:
MH

   SNO  ROLL    NAME  MARKS
0    1   101   Mahdi   95.5
1    2   102   Hasan   89.0
2    3   103   Ayaan   76.5
3    4   104  Fatima    NaN

In [13]:
MH_NON = pd.read_sql("""SELECT * FROM MAHDI_HASAN WHERE MARKS IS NULL;""", conn)

In [14]:
MH_NON

   SNO  ROLL    NAME MARKS
0    4   104  Fatima  None

In [15]:
GRADE = pd.read_sql("""
    SELECT
      SNO,
      ROLL,
      NAME,
      MARKS,
      CASE
        WHEN MARKS IS NULL THEN 'N/A'
        WHEN MARKS >= 90 THEN 'A+'
        WHEN MARKS >= 80 THEN 'A'
        WHEN MARKS >= 70 THEN 'B'
        WHEN MARKS >= 60 THEN 'C'
        WHEN MARKS >= 50 THEN 'D'
        ELSE 'F'
      END AS GRADE
    FROM MAHDI_HASAN;
""", conn)

GRADE

   SNO  ROLL    NAME  MARKS GRADE
0    1   101   Mahdi   95.5    A+
1    2   102   Hasan   89.0     A
2    3   103   Ayaan   76.5     B
3    4   104  Fatima    NaN   N/A